zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Adc/IfxVadc_Adc.h
#include "Vadc/Std/IfxVadc.h"

/******************************************************************************/
/*------------------------------Type Definitions------------------------------*/
/******************************************************************************/

typedef uint8 IfxVadc_Adc_SYNCTR_STSEL;

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Vadc_Adc_DataStructures
 * \{ */
/** \brief VADC handle data structure
 */
typedef struct
{
    Ifx_VADC *vadc;     /**< \brief Specifies the pointer to the VADC module registers */
} IfxVadc_Adc;

/** \brief Gating/Trigger configuration structure
 */
typedef struct
{
    IfxVadc_GatingSource  gatingSource;      /**< \brief Specifies used gate input for group */
    IfxVadc_TriggerSource triggerSource;     /**< \brief Specifies used Trigger input for group */
    IfxVadc_GatingMode    gatingMode;        /**< \brief Specifies gating mode. High level, Low Level  or Gating disabled */
    IfxVadc_TriggerMode   triggerMode;       /**< \brief Specifies trigger mode. Rising, falling any edge leads to an trigger event */
} IfxVadc_Adc_GatingTriggerConfig;

/** \} */

/** \addtogroup IfxLld_Vadc_Adc_DataStructures
 * \{ */
/** \brief Arbiter configuration structure.
 */
typedef struct
{
    IfxVadc_ArbitrationRounds arbiterRoundLength;                   /**< \brief Specifies arbiter round length. */
    boolean                   requestSlotQueueEnabled;              /**< \brief request queue if enabled. */
    boolean                   requestSlotScanEnabled;               /**< \brief request scan if enabled. */
    boolean                   requestSlotBackgroundScanEnabled;     /**< \brief request background scan if enabled. */
} IfxVadc_Adc_ArbiterConfig;

/** \brief Background scan mode configuration structure.
 */
typedef struct
{
    boolean                         autoBackgroundScanEnabled;     /**< \brief background autoscan functionality enable or disable. */
    IfxVadc_Adc_GatingTriggerConfig triggerConfig;                 /**< \brief trigger and gating configuration. */
    IfxVadc_RequestSlotPriority     requestSlotPrio;               /**< \brief priority of used background scan request slot. */
    IfxVadc_RequestSlotStartMode    requestSlotStartMode;          /**< \brief start mode for request background scan source. */
} IfxVadc_Adc_BackgroundScanConfig;

/** \brief Input class configuration structure
 */
typedef struct
{
    float32                   sampleTime;     /**< \brief Specifies the requested sample time for input class */
    IfxVadc_ChannelResolution resolution;     /**< \brief Specifies the conversion Mode 8,10,12Bit or 10bit fast compare */
} IfxVadc_Adc_ClassConfig;

/** \brief Group handle data structure
 */
typedef struct
{
    IfxVadc_Adc     module;      /**< \brief The VADC handle structure */
    Ifx_VADC_G     *group;       /**< \brief Pointer to the group registers */
    IfxVadc_GroupId groupId;     /**< \brief Specifies the group index */
} IfxVadc_Adc_Group;

/** \brief Queue configuration structure
 */
typedef struct
{
    boolean                         flushQueueAfterInit;      /**< \brief Specifies if the queue is flushed after configuration */
    IfxVadc_Adc_GatingTriggerConfig triggerConfig;            /**< \brief trigger and gating configuration. */
    IfxVadc_RequestSlotPriority     requestSlotPrio;          /**< \brief priority of used  queue request slot. */
    IfxVadc_RequestSlotStartMode    requestSlotStartMode;     /**< \brief start mode for request queue source. */
} IfxVadc_Adc_QueueConfig;

/** \brief Scan mode configuration structure.
 */
typedef struct
{
    boolean                         autoscanEnabled;          /**< \brief Specifies autoscan functionality. */
    IfxVadc_Adc_GatingTriggerConfig triggerConfig;            /**< \brief Specifies trigger and gating configuration */
    IfxVadc_RequestSlotPriority     requestSlotPrio;          /**< \brief priority of used  scan request slot. */
    IfxVadc_RequestSlotStartMode    requestSlotStartMode;     /**< \brief start mode for request scan source. */
} IfxVadc_Adc_ScanConfig;

/** \} */

typedef struct
{
    IfxVadc_Emux_Out  *pins[3];        /**< \brief Emux Pins configuration */
    IfxPort_OutputMode outputMode;     /**< \brief the pin output mode which should be configured */
    IfxPort_PadDriver  padDriver;      /**< \brief Pad driver */
} IfxVadc_Adc_EmuxPinConfig;

/** \addtogroup IfxLld_Vadc_Adc_DataStructures
 * \{ */
/** \brief Channel handle data structure
 */
typedef struct
{
    IfxVadc_ChannelId        channel;       /**< \brief Specifies the channel index */
    IfxVadc_ChannelResult    resultreg;     /**< \brief Specifies allocated result register */
    const IfxVadc_Adc_Group *group;         /**< \brief Specifies the group of the channel */
} IfxVadc_Adc_Channel;

/** \brief Channel configuration structure
 */
typedef struct
{
    boolean                   globalResultUsage;       /**< \brief Specifies storage in global result register */
    boolean                   synchonize;              /**< \brief Specifies synchronized conversion channel */
    boolean                   backgroundChannel;       /**< \brief Specifies channel is used as background channel */
    boolean                   rightAlignedStorage;     /**< \brief Specifies result is right aligned */
    Ifx_Priority              resultPriority;          /**< \brief Interrupt priority of the result trigger interrupt, if 0 the interrupt is disable */
    Ifx_Priority              channelPriority;         /**< \brief Interrupt priority of the channel trigger interrupt, if 0 the interrupt is disable */
    IfxSrc_Tos                resultServProvider;      /**< \brief Interrupt service provider for the result trigger interrupt */
    IfxSrc_Tos                channelServProvider;     /**< \brief Interrupt service provider for the channel trigger interrupt */
    IfxVadc_SrcNr             resultSrcNr;             /**< \brief Service node of the result trigger */
    IfxVadc_SrcNr             channelSrcNr;            /**< \brief Service node of the channel trigger */
    IfxVadc_ChannelId         channelId;               /**< \brief Specifies the channel index */
    IfxVadc_InputClasses      inputClass;              /**< \brief Specifies input class selection */
    IfxVadc_ChannelReference  reference;               /**< \brief Specifies Reference selection */
    IfxVadc_ChannelResult     resultRegister;          /**< \brief Specifies Result register selection */
    IfxVadc_BoundarySelection lowerBoundary;           /**< \brief Specifies lower boundary selection */
    IfxVadc_BoundarySelection upperBoundary;           /**< \brief Specifies upper boundary selection */
    IfxVadc_BoundaryExtension boundaryMode;            /**< \brief Specifies Standard mode of fast compare mode */
    IfxVadc_LimitCheck        limitCheck;              /**< \brief Specifies boundary band selection upper/lower */
    const IfxVadc_Adc_Group  *group;                   /**< \brief Specifies pointer to the IfxVadc_Adc_Group group handle */
} IfxVadc_Adc_ChannelConfig;

/** \brief VADC module configuration structure
 */
typedef struct
{
    Ifx_VADC               *vadc;                                                         /**< \brief Specifies the pointer to the VADC module registers */
    IfxVadc_Adc_ClassConfig globalInputClass[IFXVADC_NUM_GLOBAL_INPUTCLASSES];            /**< \brief Specifies the global conversion settings one and two */
    float32                 digitalFrequency;                                             /**< \brief Specifies digital ADC Frequency */
    float32                 analogFrequency;                                              /**< \brief Specifies analog ADC Frequency */
    float32                 moduleFrequency;                                              /**< \brief module Frequency in Hz. */
    boolean                 startupCalibration;                                           /**< \brief Can be enabled to execute a startup calibration (disabled by default).
                                                                                           * Note that this option will also enable all converter groups.
                                                                                           * If this isn't desired, don't use this option, but execute IfxVadc_Adc_startupCalibration() after all ADC groups have been initialized. */
    IfxVadc_LowSupplyVoltageSelect supplyVoltage;                                         /**< \brief Select Low Power Supply Voltage */
} IfxVadc_Adc_Config;

/** \brief Emux Control Structure
 */
typedef struct
{
    Ifx_VADC                       *vadc;                      /**< \brief pointer to Module Configuration */
    IfxVadc_ExternalMultiplexerMode mode;                      /**< \brief Specifies the External Multiplexer mode */
    IfxVadc_EmuxSelectValue         startChannel;              /**< \brief specifies the external channel start value(EMUX[x:0])
                                                                * x- specifies external channel number */
    IfxVadc_EmuxCodingScheme        code;                      /**< \brief specifes binary/gray code */
    IfxVadc_EmuxSampleTimeControl   sampleTimeControl;         /**< \brief specifies when to use sample time control */
    IfxVadc_GroupId                 groupId;                   /**< \brief specifies groupId */
    uint8                           channels;                  /**< \brief specifies channel number */
    IfxVadc_EmuxInterface           emuxInterface;             /**< \brief specifies the Emux interface */
    IfxVadc_Adc_EmuxPinConfig       emuxOutPinConfig;          /**< \brief configure the emux output pin */
    IfxVadc_ChannelSelectionStyle   channelSelectionStyle;     /**< \brief External Multiplexer Channel Selection Style */
} IfxVadc_Adc_EmuxControl;

