zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Vadc/Adc/IfxVadc_Adc.h
/** \brief Group configuration structure
 */
typedef struct
{
    const IfxVadc_Adc               *module;                                   /**< \brief Specifies pointer to the IfxVadc_Adc module handle */
    IfxVadc_GroupId                  groupId;                                  /**< \brief Specifies the group/kernel id */
    IfxVadc_GroupId                  master;                                   /**< \brief Specifies the master group. If master is different from groupId, then the group is configured as slave. */
    IfxVadc_Adc_ClassConfig          inputClass[IFXVADC_NUM_INPUTCLASSES];     /**< \brief Specifies conversion settings one and two */
    IfxVadc_Adc_ScanConfig           scanRequest;                              /**< \brief Specifies scan mode configuration */
    IfxVadc_Adc_QueueConfig          queueRequest;                             /**< \brief Specifies queued mode configuration */
    IfxVadc_Adc_BackgroundScanConfig backgroundScanRequest;                    /**< \brief Specifies back ground scan configuration */
    boolean                          disablePostCalibration;                   /**< \brief Specifies if calibration after conversion (post calibration) should be disabled */
    IfxVadc_Adc_ArbiterConfig        arbiter;                                  /**< \brief Arbiter configuration structure. */
} IfxVadc_Adc_GroupConfig;

/** \} */

/** \addtogroup IfxLld_Vadc_Adc_Module
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Reset the VADC module
 * \param vadc pointer to the VADC module
 * \return None
 *
 * Example Usage :\ref IfxLld_Vadc_Adc_Usage
 *
 */
IFX_INLINE void IfxVadc_Adc_deInitModule(IfxVadc_Adc *vadc);

/** \brief Get the current VADC configuration (e.g. VADC frequency)
 * \param vadc pointer to the VADC module
 * \param config pointer to the VADC module configuration
 * \return None
 *
 * Example Usage :\ref IfxLld_Vadc_Adc_Usage
 *
 */
IFX_INLINE void IfxVadc_Adc_getModuleConfig(IfxVadc_Adc *vadc, IfxVadc_Adc_Config *config);

/** \brief Get conversion result based on the Request Source. (Function does not care about the alignment)
 * value = raw * gain + offset
 * \param group pointer to the VADC group
 * \param channel channel number
 * \param sourceType type of request source
 * \return scaled Conversion result
 *
 * \code
 * // create configuration
 * IfxVadc_Adc_Config adcConfig;
 * IfxVadc_Adc_initModuleConfig(&adcConfig, &MODULE_VADC);
 *
 * // initialize module
 * IfxVadc_Adc vadc;
 * IfxVadc_Adc_initModule(&vadc, &adcConfig);
 *
 * // create group config
 * IfxVadc_Adc_GroupConfig adcGroupConfig;
 * IfxVadc_Adc_initGroupConfig(&adcGroupConfig, &vadc);
 *
 * // change group (default is GroupId0, change to GroupId2)
 * adcGroupConfig.groupId = IfxVadc_GroupId2;
 * adcGroupConfig.master = adcGroupConfig.groupId;
 *
 * // enable gate in "always" mode (no edge detection)
 * adcGroupConfig.scanRequest.triggerConfig.gatingMode = IfxVadc_GatingMode_always;
 *
 * // enable auto scan
 * adcGroupConfig.arbiter.requestSlotScanEnabled = TRUE;
 * adcGroupConfig.scanRequest.autoscanEnabled = TRUE;
 *
 * // initialize the group
 * IfxVadc_Adc_Group adcGroup;
 * IfxVadc_Adc_initGroup(&adcGroup, &adcGroupConfig);
 *
 * // create channel config
 * IfxVadc_Adc_ChannelConfig adcChannelConfig;
 * IfxVadc_Adc_initChannelConfig(&adcChannelConfig, &adcGroup);
 *
 * // change channel (default is ChannelId0, change to ChannelId2)
 * adcChannelConfig.channelId = IfxVadc_ChannelId2;
 *
 * // initialize the channel
 * IfxVadc_Adc_Channel adcChannel;
 * IfxVadc_Adc_initChannel(&adcChannel, &adcChannelConfig);
 *
 * uint32 channels = (1 << 2); // enable channel #2
 * uint32 mask = (1 << 7) | (1 << 2); // modify the selection for channel #7 and #2; channel #7 will be disabled
 *
 * // configure wait for read mode
 * IfxVadc_Adc_configureWaitForReadMode(&adcChannel, TRUE);
 *
 * // configure scan
 * IfxVadc_Adc_setScan(&adcGroup, channels, mask);
 *
 * // start the scan
 * IfxVadc_Adc_startScan(&adcGroup);
 *
 * // wait for valid result
 * Ifx_VADC_RES resultChannel;
 * do {
 * resultChannel = IfxVadc_Adc_getResultBasedOnRequestSource(&adcGroup, IfxVadc_ChannelId2, IfxVadc_RequestSource_scan);
 * } while( !resultChannel.B.VF );
 * \endcode
 *
 */
IFX_INLINE Ifx_VADC_RES IfxVadc_Adc_getResultBasedOnRequestSource(IfxVadc_Adc_Group *group, IfxVadc_ChannelId channel, IfxVadc_RequestSource sourceType);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disable VADC Module
 * \param vadc Pointer to VADC Module
 * \return None
 */
IFX_EXTERN void IfxVadc_Adc_disableModule(Ifx_VADC *vadc);

/** \brief Initialise the VADC to run with the expected frequency and calibration
 * \param vadc pointer to the VADC handle
 * \param config pointer to the VADC configuration
 * \return IfxVadc_Status
 *
 * For coding example see: \ref IfxLld_Vadc_Adc_Usage
 *
 */
IFX_EXTERN IfxVadc_Status IfxVadc_Adc_initModule(IfxVadc_Adc *vadc, const IfxVadc_Adc_Config *config);

/** \brief Initialise buffer with default VADC configuration
 * \param config pointer to the VADC module configuration
 * \param vadc pointer to the VADC
 * \return None
 *
 * For coding example see: \ref IfxLld_Vadc_Adc_Usage
 *
 */
IFX_EXTERN void IfxVadc_Adc_initModuleConfig(IfxVadc_Adc_Config *config, Ifx_VADC *vadc);

/** \} */

/** \addtogroup IfxLld_Vadc_Adc_Group
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Gets the current group register set
 * \param group Group handle data structure
 * \return Group register set
 *
 * Ifx_VADC* vadc = &MODULE_VADC;
 * Ifx_VADC_G* group = &MODULE_VADC.G[0]; // for group 0
 *
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //confiure wait for read mode for global result register
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult0, TRUE);
 * IfxVadc_configureWaitForReadMode(group,IfxVadc_ChannelResult1, TRUE);
 *
 * // configure scan
 * IfxVadc_setScan(group, channels, mask);
 *
 * // enable auto scan
 * IfxVadc_setAutoScan(group, TRUE);
 *
 * // start the scan
 * IfxVadc_startScan(group);
 *
 * // wait for conversion to finish
 *
 * // fetch the 2 results of conversion for group 0
 * Ifx_VADC_RES results[10];
 * result = IfxVadc_getGroupResult(group, results, 0, 2);
 *
 */
IFX_INLINE Ifx_VADC_G *IfxVadc_Adc_getGroupRegsFromGroup(const IfxVadc_Adc_Group *group);

/** \brief Get conversion result for the group
 * \param group pointer to the VADC group
 * \param results pointer to scaled conversion results
 * \param resultOffset offset for the first result
 * \param numResults number of results
 * \return None
 *
 * \code
 * // create configuration
 * IfxVadc_Adc_Config adcConfig;
 * IfxVadc_Adc_initModuleConfig(&adcConfig, &MODULE_VADC);
 *
 * // initialize module
 * IfxVadc_Adc vadc;
 * IfxVadc_Adc_initModule(&vadc, &adcConfig);
 *
 * // create group config
 * IfxVadc_Adc_GroupConfig adcGroupConfig;
 * IfxVadc_Adc_initGroupConfig(&adcGroupConfig, &vadc);
 *
 * // change group (default is GroupId0, change to GroupId2)
 * adcGroupConfig.groupId = IfxVadc_GroupId2;
 * adcGroupConfig.master = adcGroupConfig.groupId;
 *
 * // enable gate in "always" mode (no edge detection)
 * adcGroupConfig.scanRequest.triggerConfig.gatingMode = IfxVadc_GatingMode_always;
 *
 * // enable auto scan
 * adcGroupConfig.arbiter.requestSlotScanEnabled = TRUE;
 * adcGroupConfig.scanRequest.autoscanEnabled = TRUE;
 *
 * // initialize the group
 * IfxVadc_Adc_Group adcGroup;
 * IfxVadc_Adc_initGroup(&adcGroup, &adcGroupConfig);
 *
 * // create channel config
 * IfxVadc_Adc_ChannelConfig adcChannelConfig2;
 * IfxVadc_Adc_initChannelConfig(&adcChannelConfig2, &adcGroup);
 *
 * // change channel (default is ChannelId0, change to ChannelId2)
 * adcChannelConfig2.channelId = IfxVadc_ChannelId2;
 *
 * // initialize the channel
 * IfxVadc_Adc_Channel adcChannel2;
 * IfxVadc_Adc_initChannel(&adcChannel2, &adcChannelConfig2);
 *
 * // create channel config
 * IfxVadc_Adc_ChannelConfig adcChannelConfig5;
 * IfxVadc_Adc_initChannelConfig(&adcChannelConfig5, &adcGroup);
 *
 * // change channel (default is ChannelId0, change to ChannelId5)
 * adcChannelConfig5.channelId = IfxVadc_ChannelId5;
 * // change channel result register (default is ChannelResult0, change to ChannelResult1)
 * adcChannelConfig5.resultRegister = IfxVadc_ChannelResult1;
 *
 * // initialize the channel
 * IfxVadc_Adc_Channel adcChannel5;
 * IfxVadc_Adc_initChannel(&adcChannel5, &adcChannelConfig5);
 *
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * // configure wait for read mode
 * IfxVadc_Adc_configureWaitForReadMode(&adcChannel2, TRUE);
 * IfxVadc_Adc_configureWaitForReadMode(&adcChannel5, TRUE);
 *
 * // configure scan
 * IfxVadc_Adc_setScan(&adcGroup, channels, mask);
 *
 * // start the scan
 * IfxVadc_Adc_startScan(&adcGroup);
 *
 * // wait for conversion to finish
 * IfxVadc_Status scanStatus;
 * do
 * {
 *    scanStatus = IfxVadc_Adc_getScanStatus(&adcGroup);
 * } while(scanStatus==IfxVadc_Status_ChannelsStillPending);
 *
 * // fetch the 2 results of conversion for group 0
 * Ifx_VADC_RES results[10];
 * IfxVadc_Adc_getGroupResult(&adcGroup, results, 0, 2);
 * \endcode
 *
 */
IFX_INLINE void IfxVadc_Adc_getGroupResult(IfxVadc_Adc_Group *group, Ifx_VADC_RES *results, uint32 resultOffset, uint32 numResults);

